Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/worksheets/worksheet_for_calculating_rent_supplement.html.txt.tmx
Source language: en
Languages: ga

source: Worksheet for calculating Rent Supplement
ga: Bileog Oibre le haghaidh Forlíonadh Cíosa a ríomh

source: There are 6 steps to calculating your Rent Supplement
ga: Tá 6 chéim le d’Fhorlíonadh Cíosa a ríomh

source: Use the document ‘Calculating Rent Supplement’ with this worksheet
ga: Bain úsáid as an gcáipéis ‘Forlíonadh Cíosa a Ríomh’ leis an mbileog oibre seo

source: Step 1: Calculate your gross assessable weekly income from all sources
ga: Céim 1: D’ollioncam seachtainiúil inmheasúnaithe ó gach foinse a ríomh

source: │Income source │Claimant│Spouse/Partner/Cohabitant │
ga: │Foinse ioncaim │Éilitheoir│Céile/Páirtnéir/Comháitritheoir │

source: │Social welfare payments (note that some payments, such as Child Benefit, are not counted or disregarded) │ │ │
ga: │Íocaíochtaí leasa shóisialaigh (tabhair faoi deara nach gcuirtear roinnt íocaíochtaí, ar nós Sochar Linbh, san áireamh nó go dtugtar neamhaird orthu) │ │ │

source: │Income from employment or training schemes │ │ │
ga: │Ioncam ó fhostaíocht nó ó scéimeanna oiliúna │ │ │

source: │SOLAS training allowances │ │ │
ga: │Liúntais oiliúna SOLAS │ │ │

source: │Gross income from employment or self-employment │ │ │
ga: │Ollioncam ó fhostaíocht nó ó fhéinfhostaíocht │ │ │

source: │Family Income Supplement │ │ │
ga: │Forlíonadh ar Ioncam Teaghlaigh │ │ │

source: │Maintenance (include all income from maintenance) │ │ │
ga: │Cothabháil (cuir an t-ioncam ar fad ó chothabháil san áireamh) │ │ │

source: │Means from capital (for example, property, savings and investments) │ │ │
ga: │Acmhainn ó chaipiteal (mar shampla, réadmhaoin, coigilteas agus infheistíochtaí) │ │ │

source: │Other means (including occupational or foreign pensions) │ │ │
ga: │Acmhainn eile (pinsin ghairme nó pinsin eachtrach san áireamh) │ │ │

source: │Total gross assessable weekly income │ │
ga: │Ollioncam seachtainiúil inmheasúnaithe iomlán │ │

source: Step 2: Find out what your income in excess of the Supplementary Welfare Allowance (SWA) rate is
ga: Céim 2: D’ioncam de bhreis ar an ráta Liúntais Leasa Fhorlíontaigh (SWA) a fháil amach

source: To do this you deduct the Over 65 disregard, the carer’s disregard, travel costs, PRSI and the Appropriate SWA rate for your circumstances from your gross assessable income to find out what your income in excess of the SWA rate is
ga: D’fhonn é sin a dhéanamh, bain an neamhaird os cionn 65 bliain d’aois, an neamhaird do chúramóirí, costais taistil, ÁSPC agus an Ráta SWA atá oiriúnach do d’imthosca as d’ollioncam inmheasúnaithe chun d’ioncam de bhreis ar an ráta SWA a fháil amach

source: │Total gross assessable weekly income (final figure from Step 1 above) │€
ga: │Ollioncam seachtainiúil inmheasúnaithe iomlán (an figiúr deiridh ó Chéim 1 thuas) │€

source: │Subtract Over 65 disregard │ │
ga: │Dealaigh an neamhaird os cionn 65 bliain d’aois │ │

source: │Subtract Carer’s disregard │ │
ga: │Dealaigh an neamhaird do Chúramóirí │ │

source: │Subtract travel costs to work │ │
ga: │Dealaigh costais taistil chun na hoibre │ │

source: │Subtract PRSI (4% if earnings are over €352) │ │
ga: │Dealaigh ÁSPC (4% más mó tuilleamh ná €352) │ │

source: │Subtract appropriate SWA rate │ │
ga: │Dealaigh an ráta SWA atá oiriúnach │ │

source: │Income in excess of SWA rate │ │
ga: │Ioncam de bhreis ar an ráta SWA │ │

source: Step 3: Calculate the Additional income disregard or the Rehabilitative Earnings disregard (this step does not apply if you have no additional income or income from rehabilitative work)
ga: Céim 3: An neamhaird Ioncaim Bhreise nó an neamhaird Tuillimh Athshlánúcháin a ríomh (ní bheidh an chéim seo bainteach más rud é nach bhfuil aon ioncam breise ná ioncam ó obair athshlánúcháin agat)

source: │Additional income = (A+B) - C where │€
ga: │Ioncam breise = (A+B) - C sa chás gurb é │€

source: │A = Gross income from: │ │
ga: │A = Ollioncam ó: │ │

source: │ • Training or employment schemes │ │
ga: │ • Scéimeanna oiliúna nó fostaíochta │ │

source: │ • Full or part-time work │ │
ga: │ • Obair lánaimseartha nó pháirtaimseartha │ │

source: │ • Family Income Supplement │ │
ga: │ • Forlíonadh ar Ioncam Teaghlaigh │ │

source: │ • Maintenance over €95.23 a week │ │
ga: │ • Cothabháil os cionn €95.23 sa tseachtain │ │

source: │Total A: │ │
ga: │Iomlán A: │ │

source: │B = assessable income from other sources: │ │
ga: │B = ioncam inmheasúnaithe ó fhoinsí eile │ │

source: │ • Carer’s Allowance/Benefit │ │
ga: │ • Liúntas/Sochar do Chúramóirí │ │

source: │ • Occupational pensions │ │
ga: │ • Pinsin ghairme │ │

source: │ • Foreign pensions │ │
ga: │ • Pinsin eachtracha │ │

source: │ • All other DSP payments including pensions (total) │ │
ga: │ • Gach íocaíocht eile ón Roinn Coimirce Sóisialaí, lena n-áirítear pinsin (iomlán) │ │

source: │ • Income from leased farm or land │ │
ga: │ • Ioncam ó fheirm léasaithe nó ó thalamh léasaithe │ │

source: │ • Other income │ │
ga: │ • Ioncam eile │ │

source: │ • Means from capital │ │
ga: │ • Acmhainn ó chaipiteal │ │

source: │ • Subtract Carer’s disregard (To get this: subtract SWA rate (either IQA rate or single rate) from actual carer's payment) │ │
ga: │ • Dealaigh an neamhaird do Chúramóirí (Chun é sin a fháil amach: dealaigh an ráta SWA (an ráta IQA nó an ráta singil) ón íocaíocht iarbhír do chúramóirí) │ │

source: │ • Subtract Over 65 disregard (To get this: State Pension (Contributory) rate minus SWA rate) │ │
ga: │ • Dealaigh an neamhaird os cionn 65 bliain d’aois (Chun é sin a fháil amach: Ráta an Phinsin Stáit (Ranníocach) lúide an ráta SWA) │ │

source: │Total B: │ │
ga: │Iomlán B: │ │

source: │C = SWA rate for family circumstances │ │
ga: │C = ráta SWA d’imthosca teaghlaigh │ │

source: │Total C: │ │
ga: │Iomlán C: │ │

source: │(A+B) – C = Additional Income │ │
ga: │(A+B) – C = Ioncam Breise │ │

source: │Subtract PRSI, pension contributions, income continuance │ │
ga: │Dealaigh ÁSPC, ranníocaíochtaí pinsin, leanúnachas ioncaim │ │

source: │Additional Income for disregard │ │
ga: │Ioncam Breise a dtabharfar neamhaird air │ │

source: │If Additional Income for disregard is less than or equal to €75 this figure is the Additional income disregard
ga: │Más rud é go bhfuil Ioncam Breise a dtabharfar neamhaird air níos lú ná nó cothrom le €75, is é an figiúr sin an neamhaird Ioncaim Bhreise

source: │If not do this calculation: │ │
ga: │Mura bhfuil sé sin amhlaidh, déan an ríomh seo: │ │

source: │Subtract €75 │ │
ga: │Dealaigh €75 │ │

source: │25% of subtotal │ │
ga: │25% den fho-iomlán │ │

source: │Add €75 + 25% of subtotal to get Additional Income disregard │ │
ga: │Cuir €75 le 25% den fho-iomlán chun an neamhaird Ioncaim Bhreise a fháil │ │

source: │Rehabilitative Earnings disregard │€
ga: │Neamhaird Tuillimh Athshlánúcháin │€

source: │This is €120, or if your income from rehabilitative work is less than €120, use the actual figure │ │
ga: │Is ionann seo agus €120 nó, más lú d’ioncam ó obair athshlánúcháin ná €120, bain úsáid as an bhfigiúr iarbhír │ │

source: Step 4: Subtract the Additional Income disregard or the Rehabilitative earnings disregard (choose the most beneficial one if both could apply to you) from your income in excess of the SWA rate (figure at the end of Step 2)
ga: Céim 4: Dealaigh an neamhaird Ioncaim Bhreise nó an neamhaird Tuillimh Athshlánúcháin (roghnaigh an ceann is tairbhiúla duit más rud é go bhféadfadh an dá cheann bheith bainteach leat) ó d’ioncam de bhreis ar an ráta SWA (an figiúr ag deireadh Chéim 2)

source: This figure is your contribution from means
ga: Is é an figiúr seo do ranníocaíocht ó acmhainn

source: │Subtract Additional Income disregard from income in excess of SWA rate (from Step 2) or │ │
ga: │Dealaigh neamhaird Ioncaim Bhreise ó ioncam de bhreis ar an ráta SWA (ó Chéim 2) nó │ │

source: │Subtract Rehabilitative Earnings disregard from income in excess of SWA rate (from Step 2) │ │
ga: │Dealaigh Tuilleamh Athshlánúcháin ó ioncam de bhreis ar an ráta SWA (ó Chéim 2) │ │

source: │Contribution from means (this is the figure at the end of Step 2 if you have no additional income or rehabilitative earnings) │ │
ga: │Ranníocaíocht ó acmhainn (is é seo an figiúr ag deireadh Chéim 2 más rud é nach bhfuil aon ioncam breise ná tuilleamh athshlánúcháin agat) │ │

source: Step 5: Find your total weekly contribution to rent by adding your contribution from means to your minimum Household Contribution
ga: Céim 5: Do ranníocaíocht sheachtainiúil iomlán i leith cíosa a aimsiú trí do ranníocaíocht ó acmhainn a chur le d’íos-Ranníocaíocht Teaghlaigh

source: If there are other non-dependent members of the household their contribution is included at this stage
ga: Más rud é gurb ann do bhaill teaghlaigh neamhchleithiúnacha eile, cuirtear a ranníocaíocht san áireamh ag an gcéim seo

source: │Contribution from means │€
ga: │Ranníocaíocht ó acmhainn │€

source: │Add Minimum Household contribution (€30 for a single person and €40 for a couple) │ │
ga: │Cuir an íos-Ranníocaíocht Teaghlaigh leis (€30 do dhuine singil agus €40 do lánúin) │ │

source: │Add Contribution from others │ │
ga: │Cuir Ranníocaíocht ó dhaoine eile leis │ │

source: │Total weekly contribution to rent │ │
ga: │Ranníocaíocht sheachtainiúil iomlán i leith cíosa │ │

source: Step 6: Find your Rent Supplement payment by subtracting your total weekly contribution to your rent from your weekly rent
ga: Céim 6: D’íocaíocht Forlíonadh Cíosa a fháil trí do ranníocaíocht sheachtainiúil iomlán i leith do chíosa a dhealú ó do chíos seachtainiúil
